src/cf/Enums/ВидыВиджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыВиджетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Альтернативный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БлокНавигации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Диаграмма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДиаграммаСЛегендой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заголовок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Команда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комплексный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Список</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ЦветаВиджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ЦветаВиджетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Авто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Белый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Голубой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Желтый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зеленый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Красный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оранжевый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Розовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Серый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Синий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фиолетовый</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыВиджетов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет основной шрифт виджета.
Функция ОсновнойШрифтВиджета(ВидВиджета) Экспорт
	
	Если ВидВиджета = ДиаграммаСЛегендой Тогда
		ШрифтВиджета = РаботаСРабочимСтоломПовтИсп.ШрифтСтиля("ПоказательВиджетаШрифт");
		
	ИначеЕсли ВидВиджета = Заголовок Тогда
		ШрифтВиджета = РаботаСРабочимСтоломПовтИсп.ШрифтСтиля("ЗаголовокВиджетаШрифт");
		
	Иначе
		ШрифтВиджета = РаботаСРабочимСтоломПовтИсп.ШрифтСтиля("НадписьВиджетаОбычная");
		
	КонецЕсли;
	
	Возврат ШрифтВиджета;
	
КонецФункции

// Определяет вспомогательный шрифт виджета.
Функция ВспомогательныйШрифтВиджета(ВидВиджета) Экспорт
	
	Если ВидВиджета = Заголовок Тогда
		ШрифтВиджета = РаботаСРабочимСтоломПовтИсп.ШрифтСтиля("ДополнительныйПоказательВиджета");
		
	ИначеЕсли ВидВиджета = ДиаграммаСЛегендой Тогда
		ШрифтВиджета = РаботаСРабочимСтоломПовтИсп.ШрифтСтиля("СписокВиджетаШрифт");
		
	Иначе
		ШрифтВиджета = РаботаСРабочимСтоломПовтИсп.ШрифтСтиля("НадписьВиджетаОбычная");
		
	КонецЕсли;
	
	Возврат ШрифтВиджета;
	
КонецФункции

// Определяет автоматически цвет виджета.
//
// Параметры:
//  ВидВиджета - ПеречислениеСсылка.ВидыВиджетов.
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ЦветаВиджетов - Цвет виджета.
//
Функция АвтоЦвет(ВидВиджета) Экспорт
	
	Если ВидВиджета = БлокНавигации
		Или ВидВиджета = Диаграмма
		Или ВидВиджета = Заголовок Тогда
		
		Возврат Перечисления.ЦветаВиджетов.Белый;
		
	Иначе
		
		Возврат Перечисления.ЦветаВиджетов.Авто;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
